ХамелионЦРПТ/src/Catalogs/ОписаниеРегламентныхЗаданий_ХамелеонЦРПТ/ОписаниеРегламентныхЗаданий_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОписаниеРегламентныхЗаданий_ХамелеонЦРПТ</name>
  <predefined>
    <items>
      <name>МВ_АвтоматическаяОтправкаЦРПТ</name>
      <description>(МВ) Автоматическая отправка ЦРПТ</description>
    </items>
    <items>
      <name>СоздатьАгрегацииИОтправитьВЦРПТ</name>
      <description>Загрузить XML файлы с агрегациями из каталога и отправить в ЦРПТ</description>
    </items>
    <items>
      <name>ЗагрузкаВсехПриходовДиадок</name>
      <description>Загрузка всех приходов Диадок</description>
    </items>
    <items>
      <name>ЗагрузкаВсехПриходов</name>
      <description>Загрузка всех приходов по всем пользователям</description>
    </items>
    <items>
      <name>ЗагрузкаВсехПриходовСБИС</name>
      <description>Загрузка всех приходов СБИС</description>
    </items>
    <items>
      <name>ЗагрузкаВсехПриходовТакском</name>
      <description>Загрузка всех приходов Такском</description>
    </items>
    <items>
      <name>ЗагрузкаВсехПриходовЭДОЛайт</name>
      <description>Загрузка всех приходов ЭДОЛайт</description>
    </items>
    <items>
      <name>ЗагрузкаПриемки</name>
      <description>Загрузка приемки по текущему пользователю</description>
    </items>
    <items>
      <name>ЗагрузкаЧековККМизЦРПТзаВЧЕРА</name>
      <description>Загрузка чеков ККМ из ЦРПТ за ВЧЕРА</description>
    </items>
    <items>
      <name>ОбновитьСтатусыПоВемОрганизациямАгрегации</name>
      <description>Обновить статусы по всем организациям агрегации</description>
    </items>
    <items>
      <name>ОбновитьСтатусыПоВсемОрганизациямАгрегацииНаСервере</name>
      <description>Обновить статусы по всем организациям агрегации на сервере</description>
    </items>
    <items>
      <name>ОбновитьСтатусыПоВемОрганизациямВводВОборот</name>
      <description>Обновить статусы по всем организациям ввод в оборот</description>
    </items>
    <items>
      <name>ОбновитьСтатусыПоВсемОрганизациямВводВОборотНаСервере</name>
      <description>Обновить статусы по всем организациям ввод в оборот на сервере</description>
    </items>
    <items>
      <name>ОбновитьСтатусыПоВемОрганизациямПриемка</name>
      <description>Обновить статусы по всем организациям приемка</description>
    </items>
    <items>
      <name>ОбновитьСтатусыПоВсемОрганизациямПриемкаНаСервере</name>
      <description>Обновить статусы по всем организациям приемка на сервере</description>
    </items>
    <items>
      <name>Вспомогательная</name>
      <description>Обновление статусов</description>
    </items>
    <items>
      <name>ОбновлениеСтатусовПоВсем</name>
      <description>Обновление статусов по всем</description>
    </items>
    <items>
      <name>ОтправитьАгрегацииИОбновитьСтатусы</name>
      <description>Отправить агрегации и обновить статусы за 3 дня на сервере</description>
    </items>
    <items>
      <name>ПринятьПриходыПоВсемОрганизациям</name>
      <description>Подтверждать приходы по всем организациям автоматически</description>
    </items>
  </predefined>
  <attributes>
    <name>Алгоритм</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнитьНаКлиенте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ХамелионЦРПТ/src/Catalogs/ОписаниеРегламентныхЗаданий_ХамелеонЦРПТ/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура Команда1НаСервере()
	// Вставить содержимое обработчика.
	
	Справочники.ОписаниеРегламентныхЗаданий_ХамелеонЦРПТ.ОбновитьПредопределенныеРегламент();
	
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	Команда1НаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Команда2(Команда)
	// Вставить содержимое обработчика.
	Если Элементы.Список.ТекущиеДанные<>Неопределено Тогда
		ПолучитьПараметрыРегламентногоЗадания=ПараметрыРеглЗаданияТекущейСтроки(Элементы.Список.ТекущиеДанные.Ссылка);
		Если ПолучитьПараметрыРегламентногоЗадания.НаКлиенте Тогда
			Попытка
				ВыполнитьРегламентНаКлиенте_ХамелеонЦРПТ(ПолучитьПараметрыРегламентногоЗадания.Алгоритм);
			Исключение
				ПоказатьПредупреждение(,"Не удалось выполнить сценарий. Ошибка "+ОписаниеОшибки());
			КонецПопытки;
		Иначе
			Попытка
				ОбщийМодуль_ВЫПОЛНИТЬ_ВЫЗОВОМ_СЕРВЕРА_ХамелеонЦРПТ.ВыполнитьНаСервере(ПолучитьПараметрыРегламентногоЗадания.Тип);
			Исключение
				ПоказатьПредупреждение(,"Не удалось выполнить сценарий. Ошибка "+ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПараметрыРеглЗаданияТекущейСтроки(Тип)
	Возврат Новый Структура("Тип,НаКлиенте,Алгоритм",Тип.Ссылка,Тип.ВыполнитьНаКлиенте,Тип.Алгоритм);
КонецФункции
